{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {
    "allowSoftmaxApproximation" : "1"
  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "size_of_axes" : 1,
      "bottom" : "mixed2",
      "axes_0" : 0,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "mixed2_expand_dims",
      "top" : "mixed2_expand_dims",
      "type" : "expand_dims",
      "name" : "mixed2_expand_dims"
    },
    {
      "size_of_axes" : 1,
      "bottom" : "mixed6",
      "axes_0" : 0,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "mixed6_expand_dims",
      "top" : "mixed6_expand_dims",
      "type" : "expand_dims",
      "name" : "mixed6_expand_dims"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "scale0_conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "scale0_relu0",
      "K" : 288,
      "blob_biases" : 1,
      "name" : "scale0_conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "mixed2_expand_dims",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "scale0_conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "scale0_relu1",
      "K" : 128,
      "blob_biases" : 5,
      "name" : "scale0_conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "scale0_relu0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 7
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "scale1_conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "scale1_relu0",
      "K" : 768,
      "blob_biases" : 9,
      "name" : "scale1_conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "mixed6_expand_dims",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 11
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "scale1_conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "scale1_relu1",
      "K" : 128,
      "blob_biases" : 13,
      "name" : "scale1_conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "scale1_relu0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 15
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "scale2_conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "scale2_relu0",
      "K" : 128,
      "blob_biases" : 17,
      "stride_x" : 2,
      "name" : "scale2_conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "scale1_relu1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 19
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "scale2_conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "scale2_relu1",
      "K" : 128,
      "blob_biases" : 21,
      "name" : "scale2_conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "scale2_relu0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 23
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "scale3_conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "scale3_relu0",
      "K" : 128,
      "blob_biases" : 25,
      "stride_x" : 2,
      "name" : "scale3_conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "scale2_relu1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 27
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "scale3_conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "scale3_relu1",
      "K" : 128,
      "blob_biases" : 29,
      "name" : "scale3_conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "scale3_relu0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 31
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "scale4_conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "scale4_relu0",
      "K" : 128,
      "blob_biases" : 33,
      "stride_x" : 2,
      "name" : "scale4_conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "scale3_relu1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 35
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "scale4_conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "scale4_relu1",
      "K" : 128,
      "blob_biases" : 37,
      "name" : "scale4_conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "scale4_relu0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 39
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "shared_cls_conv0_scale0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_cls_scale0_relu",
      "K" : 128,
      "blob_biases" : 41,
      "name" : "shared_cls_conv0_scale0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "scale0_relu1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 43
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv0_scale0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_scale0_relu",
      "K" : 128,
      "blob_biases" : 45,
      "name" : "shared_loc_conv0_scale0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "scale0_relu1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 47
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "shared_cls_conv0_scale1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_cls_scale1_relu",
      "K" : 128,
      "blob_biases" : 49,
      "name" : "shared_cls_conv0_scale1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "scale1_relu1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 51
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv0_scale1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_scale1_relu",
      "K" : 128,
      "blob_biases" : 53,
      "name" : "shared_loc_conv0_scale1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "scale1_relu1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 55
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "shared_cls_conv0_scale2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_cls_scale2_relu",
      "K" : 128,
      "blob_biases" : 57,
      "name" : "shared_cls_conv0_scale2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "scale2_relu1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 59
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv0_scale2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_scale2_relu",
      "K" : 128,
      "blob_biases" : 61,
      "name" : "shared_loc_conv0_scale2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "scale2_relu1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 63
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "shared_cls_conv0_scale3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_cls_scale3_relu",
      "K" : 128,
      "blob_biases" : 65,
      "name" : "shared_cls_conv0_scale3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "scale3_relu1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 67
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv0_scale3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_scale3_relu",
      "K" : 128,
      "blob_biases" : 69,
      "name" : "shared_loc_conv0_scale3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "scale3_relu1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 71
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "shared_cls_conv0_scale4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_cls_scale4_relu",
      "K" : 128,
      "blob_biases" : 73,
      "name" : "shared_cls_conv0_scale4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "scale4_relu1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 75
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv0_scale4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_scale4_relu",
      "K" : 128,
      "blob_biases" : 77,
      "name" : "shared_loc_conv0_scale4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "scale4_relu1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 79
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale0_anchor0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale0_anchor0",
      "K" : 128,
      "blob_biases" : 81,
      "name" : "shared_loc_conv1_scale0_anchor0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale0_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 83
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale0_anchor1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale0_anchor1",
      "K" : 128,
      "blob_biases" : 85,
      "name" : "shared_loc_conv1_scale0_anchor1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale0_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 87
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale0_anchor2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale0_anchor2",
      "K" : 128,
      "blob_biases" : 89,
      "name" : "shared_loc_conv1_scale0_anchor2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale0_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 91
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale0_anchor3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale0_anchor3",
      "K" : 128,
      "blob_biases" : 93,
      "name" : "shared_loc_conv1_scale0_anchor3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale0_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 95
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale0_anchor4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale0_anchor4",
      "K" : 128,
      "blob_biases" : 97,
      "name" : "shared_loc_conv1_scale0_anchor4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale0_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 99
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale0_anchor5",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale0_anchor5",
      "K" : 128,
      "blob_biases" : 101,
      "name" : "shared_loc_conv1_scale0_anchor5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale0_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 103
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale0_anchor6",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale0_anchor6",
      "K" : 128,
      "blob_biases" : 105,
      "name" : "shared_loc_conv1_scale0_anchor6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale0_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 107
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale0_anchor7",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale0_anchor7",
      "K" : 128,
      "blob_biases" : 109,
      "name" : "shared_loc_conv1_scale0_anchor7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale0_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 111
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale0_anchor8",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale0_anchor8",
      "K" : 128,
      "blob_biases" : 113,
      "name" : "shared_loc_conv1_scale0_anchor8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale0_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 115
    },
    {
      "weights" : {

      },
      "debug_info" : "loc_concat_scale0",
      "top" : "loc_concat_scale0",
      "type" : "concat",
      "name" : "loc_concat_scale0",
      "bottom" : "shared_loc_conv1_scale0_anchor0,shared_loc_conv1_scale0_anchor1,shared_loc_conv1_scale0_anchor2,shared_loc_conv1_scale0_anchor3,shared_loc_conv1_scale0_anchor4,shared_loc_conv1_scale0_anchor5,shared_loc_conv1_scale0_anchor6,shared_loc_conv1_scale0_anchor7,shared_loc_conv1_scale0_anchor8"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale1_anchor0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale1_anchor0",
      "K" : 128,
      "blob_biases" : 117,
      "name" : "shared_loc_conv1_scale1_anchor0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 119
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale1_anchor1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale1_anchor1",
      "K" : 128,
      "blob_biases" : 121,
      "name" : "shared_loc_conv1_scale1_anchor1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 123
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale1_anchor2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale1_anchor2",
      "K" : 128,
      "blob_biases" : 125,
      "name" : "shared_loc_conv1_scale1_anchor2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 127
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale1_anchor3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale1_anchor3",
      "K" : 128,
      "blob_biases" : 129,
      "name" : "shared_loc_conv1_scale1_anchor3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 131
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale1_anchor4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale1_anchor4",
      "K" : 128,
      "blob_biases" : 133,
      "name" : "shared_loc_conv1_scale1_anchor4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 135
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale1_anchor5",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale1_anchor5",
      "K" : 128,
      "blob_biases" : 137,
      "name" : "shared_loc_conv1_scale1_anchor5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 139
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale1_anchor6",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale1_anchor6",
      "K" : 128,
      "blob_biases" : 141,
      "name" : "shared_loc_conv1_scale1_anchor6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 143
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale1_anchor7",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale1_anchor7",
      "K" : 128,
      "blob_biases" : 145,
      "name" : "shared_loc_conv1_scale1_anchor7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 147
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale1_anchor8",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale1_anchor8",
      "K" : 128,
      "blob_biases" : 149,
      "name" : "shared_loc_conv1_scale1_anchor8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 151
    },
    {
      "weights" : {

      },
      "debug_info" : "loc_concat_scale1",
      "top" : "loc_concat_scale1",
      "type" : "concat",
      "name" : "loc_concat_scale1",
      "bottom" : "shared_loc_conv1_scale1_anchor0,shared_loc_conv1_scale1_anchor1,shared_loc_conv1_scale1_anchor2,shared_loc_conv1_scale1_anchor3,shared_loc_conv1_scale1_anchor4,shared_loc_conv1_scale1_anchor5,shared_loc_conv1_scale1_anchor6,shared_loc_conv1_scale1_anchor7,shared_loc_conv1_scale1_anchor8"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale2_anchor0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale2_anchor0",
      "K" : 128,
      "blob_biases" : 153,
      "name" : "shared_loc_conv1_scale2_anchor0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale2_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 155
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale2_anchor1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale2_anchor1",
      "K" : 128,
      "blob_biases" : 157,
      "name" : "shared_loc_conv1_scale2_anchor1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale2_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 159
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale2_anchor2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale2_anchor2",
      "K" : 128,
      "blob_biases" : 161,
      "name" : "shared_loc_conv1_scale2_anchor2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale2_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 163
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale2_anchor3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale2_anchor3",
      "K" : 128,
      "blob_biases" : 165,
      "name" : "shared_loc_conv1_scale2_anchor3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale2_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 167
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale2_anchor4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale2_anchor4",
      "K" : 128,
      "blob_biases" : 169,
      "name" : "shared_loc_conv1_scale2_anchor4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale2_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 171
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale2_anchor5",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale2_anchor5",
      "K" : 128,
      "blob_biases" : 173,
      "name" : "shared_loc_conv1_scale2_anchor5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale2_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 175
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale2_anchor6",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale2_anchor6",
      "K" : 128,
      "blob_biases" : 177,
      "name" : "shared_loc_conv1_scale2_anchor6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale2_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 179
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale2_anchor7",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale2_anchor7",
      "K" : 128,
      "blob_biases" : 181,
      "name" : "shared_loc_conv1_scale2_anchor7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale2_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 183
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale2_anchor8",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale2_anchor8",
      "K" : 128,
      "blob_biases" : 185,
      "name" : "shared_loc_conv1_scale2_anchor8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale2_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 187
    },
    {
      "weights" : {

      },
      "debug_info" : "loc_concat_scale2",
      "top" : "loc_concat_scale2",
      "type" : "concat",
      "name" : "loc_concat_scale2",
      "bottom" : "shared_loc_conv1_scale2_anchor0,shared_loc_conv1_scale2_anchor1,shared_loc_conv1_scale2_anchor2,shared_loc_conv1_scale2_anchor3,shared_loc_conv1_scale2_anchor4,shared_loc_conv1_scale2_anchor5,shared_loc_conv1_scale2_anchor6,shared_loc_conv1_scale2_anchor7,shared_loc_conv1_scale2_anchor8"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale3_anchor0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale3_anchor0",
      "K" : 128,
      "blob_biases" : 189,
      "name" : "shared_loc_conv1_scale3_anchor0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale3_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 191
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale3_anchor1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale3_anchor1",
      "K" : 128,
      "blob_biases" : 193,
      "name" : "shared_loc_conv1_scale3_anchor1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale3_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 195
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale3_anchor2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale3_anchor2",
      "K" : 128,
      "blob_biases" : 197,
      "name" : "shared_loc_conv1_scale3_anchor2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale3_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 199
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale3_anchor3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale3_anchor3",
      "K" : 128,
      "blob_biases" : 201,
      "name" : "shared_loc_conv1_scale3_anchor3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale3_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 203
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale3_anchor4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale3_anchor4",
      "K" : 128,
      "blob_biases" : 205,
      "name" : "shared_loc_conv1_scale3_anchor4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale3_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 207
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale3_anchor5",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale3_anchor5",
      "K" : 128,
      "blob_biases" : 209,
      "name" : "shared_loc_conv1_scale3_anchor5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale3_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 211
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale3_anchor6",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale3_anchor6",
      "K" : 128,
      "blob_biases" : 213,
      "name" : "shared_loc_conv1_scale3_anchor6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale3_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 215
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale3_anchor7",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale3_anchor7",
      "K" : 128,
      "blob_biases" : 217,
      "name" : "shared_loc_conv1_scale3_anchor7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale3_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 219
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale3_anchor8",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale3_anchor8",
      "K" : 128,
      "blob_biases" : 221,
      "name" : "shared_loc_conv1_scale3_anchor8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale3_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 223
    },
    {
      "weights" : {

      },
      "debug_info" : "loc_concat_scale3",
      "top" : "loc_concat_scale3",
      "type" : "concat",
      "name" : "loc_concat_scale3",
      "bottom" : "shared_loc_conv1_scale3_anchor0,shared_loc_conv1_scale3_anchor1,shared_loc_conv1_scale3_anchor2,shared_loc_conv1_scale3_anchor3,shared_loc_conv1_scale3_anchor4,shared_loc_conv1_scale3_anchor5,shared_loc_conv1_scale3_anchor6,shared_loc_conv1_scale3_anchor7,shared_loc_conv1_scale3_anchor8"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale4_anchor0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale4_anchor0",
      "K" : 128,
      "blob_biases" : 225,
      "name" : "shared_loc_conv1_scale4_anchor0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale4_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 227
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale4_anchor1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale4_anchor1",
      "K" : 128,
      "blob_biases" : 229,
      "name" : "shared_loc_conv1_scale4_anchor1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale4_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 231
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale4_anchor2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale4_anchor2",
      "K" : 128,
      "blob_biases" : 233,
      "name" : "shared_loc_conv1_scale4_anchor2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale4_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 235
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale4_anchor3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale4_anchor3",
      "K" : 128,
      "blob_biases" : 237,
      "name" : "shared_loc_conv1_scale4_anchor3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale4_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 239
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale4_anchor4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale4_anchor4",
      "K" : 128,
      "blob_biases" : 241,
      "name" : "shared_loc_conv1_scale4_anchor4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale4_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 243
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale4_anchor5",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale4_anchor5",
      "K" : 128,
      "blob_biases" : 245,
      "name" : "shared_loc_conv1_scale4_anchor5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale4_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 247
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale4_anchor6",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale4_anchor6",
      "K" : 128,
      "blob_biases" : 249,
      "name" : "shared_loc_conv1_scale4_anchor6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale4_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 251
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale4_anchor7",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale4_anchor7",
      "K" : 128,
      "blob_biases" : 253,
      "name" : "shared_loc_conv1_scale4_anchor7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale4_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 255
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_loc_conv1_scale4_anchor8",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_loc_conv1_scale4_anchor8",
      "K" : 128,
      "blob_biases" : 257,
      "name" : "shared_loc_conv1_scale4_anchor8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "shared_loc_scale4_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 259
    },
    {
      "weights" : {

      },
      "debug_info" : "loc_concat_scale4",
      "top" : "loc_concat_scale4",
      "type" : "concat",
      "name" : "loc_concat_scale4",
      "bottom" : "shared_loc_conv1_scale4_anchor0,shared_loc_conv1_scale4_anchor1,shared_loc_conv1_scale4_anchor2,shared_loc_conv1_scale4_anchor3,shared_loc_conv1_scale4_anchor4,shared_loc_conv1_scale4_anchor5,shared_loc_conv1_scale4_anchor6,shared_loc_conv1_scale4_anchor7,shared_loc_conv1_scale4_anchor8"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_cls_conv1_scale0_anchor0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_cls_conv1_scale0_anchor0",
      "K" : 128,
      "blob_biases" : 261,
      "name" : "shared_cls_conv1_scale0_anchor0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "shared_cls_scale0_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 263
    },
    {
      "bottom" : "shared_cls_conv1_scale0_anchor0",
      "weights" : {

      },
      "debug_info" : "Probability_scale0_anchor0",
      "top" : "Probability_scale0_anchor0",
      "C" : 2,
      "type" : "softmax",
      "name" : "Probability_scale0_anchor0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_cls_conv1_scale0_anchor1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_cls_conv1_scale0_anchor1",
      "K" : 128,
      "blob_biases" : 265,
      "name" : "shared_cls_conv1_scale0_anchor1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "shared_cls_scale0_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 267
    },
    {
      "bottom" : "shared_cls_conv1_scale0_anchor1",
      "weights" : {

      },
      "debug_info" : "Probability_scale0_anchor1",
      "top" : "Probability_scale0_anchor1",
      "C" : 2,
      "type" : "softmax",
      "name" : "Probability_scale0_anchor1"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_cls_conv1_scale0_anchor2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "shared_cls_conv1_scale0_anchor2",
      "K" : 128,
      "blob_biases" : 269,
      "name" : "shared_cls_conv1_scale0_anchor2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "shared_cls_scale0_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 4,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 271
    },
    {
      "bottom" : "shared_cls_conv1_scale0_anchor2",
      "weights" : {

      },
      "debug_info" : "Probability_scale0_anchor2",
      "top" : "Probability_scale0_anchor2",
      "C" : 2,
      "type" : "softmax",
      "name" : "Probability_scale0_anchor2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "shared_cls_conv1_scale0_anchor3",
